import urllib.request
import json
import os
import urllib.request
import json


os.system('clear')

banner = ("""
\033[34m 

\t▄▀▀ █▀▄ ▀▄░▄▀ ▀ █▄░█ █▀ ▄▀▄ 
\t░▀▄ █░█ ░░█░░ █ █░▀█ █▀ █░█ 
\t▀▀░ █▀░ ░░▀░░ ▀ ▀░░▀ ▀░ ░▀░ 
		
		 	        [1.0.1v]



\033[33m [\033[36m1\033[33m]\033[36m - Пробив по номеру телефона

\033[33m [\033[36m2\033[33m]\033[36m - Пробив по IP

\033[33m [\033[36m3\033[33m]\033[36m - Инструкция

\033[33m [\033[36m4\033[33m]\033[36m - Что нового?

\033[33m [\033[36m5\033[33m]\033[36m - Купить чашечку кофе разработчику

\033[33m [\033[36m0\033[33m]\033[36m - Выход

________________________________________________
""")
print(banner)
number = int(input("\n\n\n \033[33m[\033[31m!\033[33m] \033[36mВыберите вариант --->\033[32m "))
if number==1:
	phone = input("\n \033[33m[\033[32m+\033[33m] Введите телефон без + (пример: 7123456789):\033[32m ")
	getInfo = "https://htmlweb.ru/geo/api.php?json&telcod=" + phone
	try:
	    infoPhone = urllib.request.urlopen( getInfo )
	except:
	    print( "\n[!] - Нет такого телефона - [!]\n" )
	infoPhone = json.load( infoPhone )
	print( u"Номер сотового --->", "+" + phone )
	print( u"Страна ---> ", infoPhone["country"]["name"] )
	print( u"Регион ---> ", infoPhone["region"]["name"] )
	print( u"Округ ---> ", infoPhone["region"]["okrug"] )
	print( u"Оператор ---> ", infoPhone["0"]["oper"] )
	print( u"Часть света ---> ", infoPhone["country"]["location"] )
	
	
	number = int(input("\n\n\n \033[33m[\033[31m!\033[33m] \033[36mВыберите номер --->\033[32m "))



#----------------------------------------------------

elif number == 2:
	getIP = input("\n \033[33m[\033[32m+\033[33m]\033[33m Введите IP --> \033[32m")
	url = "https://ipinfo.io/" + getIP + "/json"
	
	try:
	    getInfo = urllib.request.urlopen( url )
	
	except:
	    print( "\n\033[32m[\033[31m!\033[32m]\033[31m - Такого IP не существует! Перезапустите программу и введите правильный. - \033[32m[\033[31m!\033[32m]\n" )
	
	infoList = json.load(getInfo)
	
	def whoisIPinfo(ip):
	
	    try:
	
	        myComand = "whois " + getIP
	        whoisInfo = os.popen( myComand ).read()
	        return whoisInfo
	
	    except:
	
	        return "\n [!] -- Error -- [!] \n"

     
	print( "-" * 60 )
	


	print("\033[32mIP: ", infoList["ip"] )
	print( "Регион: ", infoList["region"] )
	print( "Страна: ", infoList["country"] )
	print( "Название хоста: ", infoList["hostname"] )
	print( "Координаты: ", infoList["loc"])
	
	print( "-" * 60 )
	
	print( "-" * 60)
	
#-----------------------------------------------------------------

elif number == 3:
	print("""\033[36m
 Эта утилита разработана и пренадлежит Льву Цхай, основателю Tskhay Glibal.
 	
\033[33m 	КАК ИСПОЛЬЗОВАТЬ?
 	\033[36m
 Чтобы узнать из какой страны и региона номер, запустиие утилиту. Введите цифру 1 и введите номер телнфона.
 Чтобы узнать местоположение IP, введите 2, введите IP. На данный момент мы разрабатываем функцию, через которую проще будет узнать IP - адрес чужого телефона.
 	\033[33m
 	ПОДВОДНЫЕ КАМНИ!!!
 	\033[36m
 Если телефон подключён к интернету/WiFi, то вы узнаете не местополодение телефона, а место нахождение роутера. Чтобы определить точный IP - адрес, нужно
убедиться, что прослеживаемый IP отключён от WiFi или интернета.
Чтобы узнать какую функцию преобрела утитилита после обновления, напишите 4 в терминал запущенной утилиты.
 Получайте новости в нашем тг канале:
 	
https://t.me/tskhayglobal

Купить чашечку кофе разработчику можно по этой ссылке:
	
https://my.qiwi.com/Yoann-TsTRRrbWr5n
	""")
	
#----------------------------------------------------------------------
elif number == 4:
	print("""
Что нового:
\033[35m
[26.01.2022] Создана эта утилита

[1.0.1] Добавлена инструкция использования утилиты
	""")
#----------------------------------------------------------------------
elif number == 5:
	print("""\033[33m
	☕ Купить чашечку кофе разработчику:
		
https://oplata.qiwi.com/form?invoiceUid=99565ac6-5e0e-47f2-8ea8-37ff6b62d4aa

	 Внести свою сумму:
	 	
https://my.qiwi.com/Yoann-TsTRRrbWr5n
	""")
#----------------------------------------------------------------------
elif number == 0:
	os.system('clear')
	quit()